{"Title":{"0":"List of Ineligible Candidates for various posts for CMOH, Jalpaiguri","1":"Tender cancellation Notice for procurement of Dental Equipments (Non CAT) from Alipurduar district with memo CMOH\/APD\/No-3729 dated 7\/11\/2023","2":"Corrigendum Notice for extension of date for opening of quotation with to Memo No CMOH (N24Pgs)\/9124 dt. 07\/11\/2023 & Memo No. CMOH(N24pgs)\/9434 dt. 21-11-23 under CMOH North 24 parganas","3":"Notification for 2nd Round Counselling and Admission to Diploma in Pharmacy Course for Academic Session 2023-24","4":"Rank List, Counseling Schedule and Available Vacancies for Internship of FMGs","5":"Notice for Document Verification for the post of Ayurvedic Pharmacists","6":"Notification of Counseling for admission in Certificate Course of Panchakarma Assistant in the session 2023-2024 at Patipukur Ayurvedic Hospital","7":"Corrigendum recruitment Notice for CMOH, Malda","8":"Cancellation of E-tender of IEC Articles of CMOH, Hooghly with notice no- Estt\/IEC\/E Tender\/5843 dated 20\/7\/2023","9":"Cancellation of E-tender Notice of Priting Articles with notice no-Estt\/5842 dated 20\/7\/2023 under CMOH Hooghly","10":"Addendum reg. recruitment notice of Yoga Instructor (male & female) for different AHWCs in Alipurduar district vide memo. no. DH&FWS-APD-741, dated 22.11.2023","11":"Intimation regarding short expiry & slow moving medinine from Tamralipta GMCH","12":"Extension order for supply of cooked food, dry foods, tea and snacks to the meetings and trainings","13":"Extension Order for supply of Lab Consumables Items","14":"Provisional List of Patients for Kidney Board Meeting scheduled on 28.11.2023","15":"Offer letter for Cleaning & Housekeeping staff in RH,BPHC,PHC in Murshidabad District","16":"Provisional vacancy list for walk-in-counselling for the post of contractual CHOs","17":"Notice on distribution of very slow moving medicines to other healthcare unit(s) from IDBG Hospital","18":"Expression of Interest for RG Kar MCH, Kolkata","19":"Intimation regarding slow moving\/ short expire drugs under Medical College & Hospital, Kolkata","20":"Application invited for Clinical Psychologist and Psychiatric Social Worker at Lumbini Park Mental Hospital, Kolkata","21":"Information regarding short expiry Medicines under Sulkapara BPHC Nagrakata Block, BMOH Jalpaiguri","22":"Merit List for the recruitment of Staff Nurse in the Thalassaemia control unit of CNMC&H, Kolkata","23":"Walk-in-counselling of CPCH passed candidates for posting as CHOs","24":"walk-in-counselling for transfer posting of CHOs","25":"Schedule of the Departmental Promotion under W.B.M.E.S","26":"Corrigendum Regarding Non Bonded Contractual Senior Resident Recruitment","27":"Date, Time & Venue of Medical Examination for appointment to the W.B.S.L.R.S., Grade-I under L. & L. R. and R.R & R. Department","28":"Medical examination for various posts under Medical College & Hospital, Kolkata","29":"Notice on List of Applicants not submitted Hard copies for different Posts under Uttar Dinajpur","30":"Meeting regarding various non compliances of the Bio-medical wastes Management","31":"Information Regarding Near Expiry Medicine from Alipurduar District Hospital","32":"Cancellation of quotation for School of Tropical Medicine, Kolkata with memo no. STM\/STORE\/QUOTE\/092\/2023-24, dated 2\/11\/2023","33":"Date, Time & Venue of Medical Examination for appointment to the post of Veterinary Officer under Animal Resources Development Department","34":"Submission of Shortfall Documents as asked earlier in reference to NIET no. 19 of 2023-24 (2nd Call) for CMOH, Uttar Dinajpur","35":"Important Instruction regarding departmental Promotion after completion of BCBR & BCMET training on and before 30.11.2023","36":"Technical & Financial BID assessment of NIQ vide memo no. BMCH\/3156 Dated 30.10.2023 for supply of Hydrocortisone Sodium Succinate Inj. I.P. 100 mg\/vial, at BMCH, Purba Bardhaman","37":"BID cancellation of NIQ vide memo no. BMCH\/3157 Dated 30.10.2023 for supply of Dexamethasone Sodium Phosphate Inj. I.P. 8mg\/2ml. vial, at BMCH, Purba Bardhaman","38":"AOC\/ Letter of Acceptance\/ Work Order for Re e-tender (2nd Call) for procurement of Laboratory Consumables for NTEP of Nadia","39":"Intimation regarding slow moving & short expiry of medicines for Howrah District Hospital","40":"Public Notice for Internship of FMGs Second batch 2023","41":"Provisional List of Patients for Kidney Board Meeting","42":"Cancellation notification for YOGA instructor under Ayush at CMOH, Birbhum","43":"Technical & Financial BID assessment of NIQ memo no. BMCH\/3088 Dated 13.10.2023 for supply of Liquified Phenol I.P.99% (Carbolic Acid) at BMCH, Purba Bardhaman","44":"BID Cancellation Notice of Re-quotation (2nd Call) memo no. BMCH\/3087 Dated 13.10.2023 for supply of Formalin solution 40% at BMCH, Purba Bardhaman","45":"Financial bid assessment of Quotation for Burdwan Medical College & Hospital","46":"Intimation regarding Short Expiry & Slow Moving Medicine at Mal SD Hospital","47":"Rescheduled Physical Stray Vacancy round counselling for ANM(R) from Nursing Branch","48":"Agreement sign of EOM project at different Govt. hospital of WB under PPP Mode","49":"EXTENSION OF TENDER NOTICE FOR (X-RAY FILM & X-RAY HYPO SOLUTION) UNDER GABBERIA SGH , HOWRAH","50":"Amendment-Corrigendum Notice_3127 dated 30\/10\/2023 for Selection of Private Partner for setting up & operationalization of a Radiotherapy Centre at Midnapore MCH under PPP Cell","51":"Extension of timeline for signing of agreement of establishment & maintenance of CT scan centres & Dialysis centres of at different Govt. hospitals on PPP mode","52":"Cancellation of Quotation Notice reg. procurement of printing materials under AYUSH Gram Activitiy in Alipurduar district with memo no- CMOH\/APD\/3217 dated 22\/09\/2023","53":"Advertisement for Admission into Diploma Course in Ayurvedic Pharmacy for the Session 2023-2024","54":"Notice on review & visioning workshop on Hepatitis on 9th & 10th Nov, 2023","55":"AOC\/ Letter of Acceptance\/ Work Order for Re-E-Tender (2nd Call) for procurement of ECD kit under DPMU, Nadia","56":"Notice for Meeting on Pre Bid Tender for supply of rental Vehicles under DFWB, Kolkata","57":"Notice regarding Extension of last date of online bid submission with memo no DHFWS\/CW\/30 2022-23(3rd call) and DHFWS\/CW\/13 2023-24(2nd call) for creation of herbal garden under CMOH Jalpaiguri","58":"Minutes of Meeting of State Level Expert Committee on Radiology and Dialysis","59":"Corrigendum regarding Minutes of the Pre Bid Meeting for RFP for Selection of Private Partner for Setting up and operationalization of a Radiotherapy Centre","60":"Intimation regarding Slow Moving\/Short Expiry date of medicine, COMJNMH, Kalyani","61":"Nomination as non-official members of the West Bengal Mental Health Authority","62":"Financial bid Assessment of Notice Inviting Quotation for Equipments\/ Items for Burdwan Medical College & Hospital","63":"Quotation Cancellation Notice for supply of Liquified Phenol I.P.99% (Carbolic Acid) at Burdwan Medical College and Hospital, Purba Bardhaman. with memo BMCH\/2942 dated 4\/10\/2023","64":"Quotation Cancellation Notice for supply of Formalin Solution 40% at Burdwan Medical College and Hospital, Purba Bardhaman with memo no-BMCH\/2941 dated- 4\/10\/2023","65":"Notice for House Staff (J.R). under MSVP, Malda MCH","66":"Cancellation notice for the post of JR under Malda MCH with memo no 6199\/MLDMCH\/1(8) dated 5\/10\/2023","67":"Intimation regarding slow-moving and near expiry medicines of District Hospital, Howrah","68":"Financial Bid Assessment of Burdwan Medical College & Hospital","69":"DNB PDCET Notice and Seat Matrix related to State quota counseling 2023","70":"PPP (Radiology & Dialysis) related Meeting on 13.10.2023","71":"Notice relating to cancellation of ASHA engagement notification on contractual basis under CMOH Purba Bardhawan","72":"Scheduled for PG Ayush Counseling 2023","73":"Date, Time & Venue of Medical Exam for appointment to the post of Joint Block Development Officer under Panchayats & Rural Development Dept.","74":"Technical & Financial Bid Assessment of NIQ vide Memo No. BMCH\/2978 Dated 06\/10\/2023 for Burdwan MCH","75":"Technical & Financial Bid Assessment of NIQ vide Memo No. BMCH\/2977 Dated 06\/10\/2023 for Burdwan MCH","76":"Notification for documents verification, 1st round counseling and admission to Diploma in Pharmacy Course for Academic Session 2023-24","77":"Provisional list of kidney patients to attend the board meeting on 10\/10\/2023","78":"Information Regarding Short expiry Medicine from Midnapore MCH","79":"Selected bidders meeting for Cleaning and House Keeping Services under CMOH Purba Bardhaman","80":"Notice on selected bidder from CMOH Uttar Dinajpur with nit no- 19 of 2023-24(2nd call)","81":"Date, Time & Venue of Medical Examination for appointment to the post of LDC under Directorate of Forests (5 Candidates)","82":"Intimation regarding short-expiry medicine at Moulani PHC, Mal Block, Jalpaiguri","83":"Cancellation Notice of E-Tender under Berhampore Mental Hospital, Murshidabad with tender reference no - BMH\/01\/2023-2024 & tender id 2023_HFW_552304_1","84":"Intimation regarding short expiry & slow moving medicine at Kharagpur SDH","85":"Information Regarding Near Expiry Medicine from Alipurduar DH","86":"Cancellation of E-Tender Notice for CMOH office Cooch Behar with memo no CMOH\/CBR\/2023-2024\/NTEP\/35","87":"Information regarding slow-moving and near expiry medicines of Gandhi Memorial Hospital, Nadia"},"Description":{"0":"List of Ineligible Candidates for various posts for CMOH, Jalpaiguri vide Ref. Advt. No. DHFWS\/1122\/23 dated. 26.07.2023","1":"Tender cancellation Notice for procurement of Dental Equipments (Non CAT) from Alipurduar district with memo no- CMOH\/APD\/No-3729 dated 7\/11\/2023","2":"Corrigendum Notice for extension of date for opening of quotation with to Memo No CMOH (N24Pgs)\/9124 dt. 07\/11\/2023 & Memo No. CMOH(N24pgs)\/9434 dt. 21-11-23 under CMOH North 24 parganas .","3":"Notification for 2nd Round Counselling and Admission to Diploma in Pharmacy Course (Institute of Pharmacy, Kalyani\/ Bankura\/ Jalpaiguri) for Academic Session 2023-24","4":"Rank List, Counseling Schedule and Available Vacancies for Internship of FMGs.","5":"Notice for Document Verification for the post of Ayurvedic Pharmacists on 12.12.2023","6":"Notification of Counseling for admission in Certificate Course of Panchakarma Assistant in the session 2023-2024 at Patipukur Ayurvedic Hospital.","7":"Corrigendum recruitment Notice for CMOH, Malda vide Memo No. HFW-27038\/12\/2023\/2508 dated. 20.04.2023","8":"Cancellation of E-tender of IEC Articles of CMOH Hooghly with notice no - Estt\/IEC\/E Tender\/5843 dated 20\/7\/2023","9":"Cancellation of E-tender Notice for Priting Articles with notice no-Estt\/5842 dated 20\/7\/2023 under CMOH Hooghly","10":"Addendum reg. recruitment notice of Yoga Instructor (male & female) for different AHWCs in Alipurduar district vide Memo. no. DH&FWS-APD-741, dated 22.11.2023","11":"Intimation regarding short expiry & slow moving medinines from Tamralipta GMCH","12":"Extension order for supply of cooked food, dry foods, tea and snacks to the meetings and trainings to the office of the CMOH, Barasat under North 24 Parganas District","13":"Extension Order for supply of Lab Consumables Items for District Tuberculosis centre (DTC) North 24Parganas District","14":"Provisional List of Patients for Kidney Board Meeting scheduled on 28.11.2023 at Swasthya Bhawan","15":"Offer letter for Cleaning & Housekeeping staff in RH,BPHC & PHC in Murshidabad District","16":"Provisional vacancy list for walk-in-counselling for the post of contractual CHOs to be held on 29.11.2023","17":"Notice on distribution of very slow moving medicines to other healthcare unit(s) from ID&BG Hospital","18":"Expression of Interest for RG Kar MCH, Kolkata on 21\/11\/2023","19":"Intimation regarding slow moving\/ short expire drugs under Medical College and Hospital, Kolkata","20":"Application Invited for Clinical Psychologist and Psychiatric Social Worker at Lumbini Park Mental Hospital, Kolkata","21":"Information regarding short expiry Medicines under Sulkapara BPHC, Nagrakata Block, BMOH Jalpaiguri","22":"Merit List for the recruitment of Staff Nurse in the Thalassaemia control unit of CNMC&H, Kolkata.","23":"Walk-in-counselling of CPCH passed candidates for posting as CHOs.","24":"walk-in-counselling for transfer posting of CHOs.","25":"Schedule of the Departmental Promotion under W.B.M.E.S 2023","26":"Corrigendum Regarding Non Bonded Contractual Senior Resident Recruitment for Diamond Harbour Government Medical College & Hospital vide Memo No. DHGMC\/2023\/1970 dated. 10.11.2023","27":"Date, Time & Venue of Medical Examination for appointment to the W.B.S.L.R.S., Grade-I under L. & L. R. and R.R & R. Department.","28":"Medical examination for various posts under Medical College & Hospital, Kolkata on 29-11-2023","29":"Notice on List of Applicants not submitted Hard copies for different Posts under Uttar Dinajpur  vide Advt. No. DHFWS\/UD\/ADV\/NHM\/XV-FC\/1479\/23 Dated 08-09-2023","30":"Meeting regarding various non compliances of the Bio-medical wastes Management Rules","31":"Information Regarding Near Expiry Medicine from Alipurduar District Hospital.","32":"Cancellation of quotation for School of Tropical Medicine, Kolkata with memo no. STM\/STORE\/QUOTE\/092\/2023-24, Dated 2\/11\/2023","33":"Date, Time & Venue of Medical Examination for appointment to the post of Veterinary Officer under Animal Resources Development Department.","34":"Submission of Shortfall Documents as asked earlier in reference to NIET no. 19 of 2023-24 (2nd Call) for CMOH, Uttar Dinajpur.","35":"Important Instruction regarding departmental Promotion after completion of BCBR & BCMET training on and before 30.11.2023.","36":"Technical & Financial BID assessment of NIQ vide memo no. BMCH\/3156 Dated 30.10.2023 for supply of Hydrocortisone Sodium Succinate Inj. I.P. 100 mg\/vial, at BMCH, Purba Bardhaman.","37":"BID cancellation of NIQ vide memo no. BMCH\/3157 Dated 30.10.2023 for supply of Dexamethasone Sodium Phosphate Inj. I.P. 8mg\/2ml. vial, at BMCH, Purba Bardhaman.","38":"AOC\/ Letter of Acceptance\/ Work Order for Re e-tender (2nd Call) for procurement of Laboratory Consumables for NTEP of Nadia vide Memo no. CMOH-Nad\/4166, dated 25\/07\/2023","39":"Intimation regarding slow moving & short expiry of medicines for Howrah District Hospital.","40":"Public Notice for Internship of FMGs Second batch 2023.","41":"Provisional List of Patients for Kidney Board Meeting scheduled on 07.11.2023","42":"Cancellation notification for YOGA instructor under Ayush at CMOH, Birbhum vide Memo No. DHFWS-II\/AYUSH\/1071 dated. 01.11.2023","43":"Technical & Financial BID assessment of NIQ memo no. BMCH\/3088 Dated 13.10.2023 for supply of Liquified Phenol I.P.99% (Carbolic Acid) at BMCH, Purba Bardhaman.","44":"BID Cancellation Notice of Re-quotation (2nd Call) memo no. BMCH\/3087 Dated 13.10.2023 for supply of Formalin solution 40% at BMCH, Purba Bardhaman.","45":"Financial bid assessment of Quotation for Burdwan Medical College & Hospital vide no BMCH\/3055,3056,3057,3058,3090","46":"Intimation regarding Short Expiry & Slow Moving Medicine at Mal SD Hospital.","47":"Rescheduled Physical Stray Vacancy round counselling for ANM(R) from Nursing Branch on 1\/11\/2023 at IPGMER & SSKM Hospital, Kolkata","48":"Agreement sign of EOM project at different Govt. hospital of WB under PPP Mode.","49":"EXTENSION OF TENDER NOTICE FOR (X-RAY FILM & X-RAY HYPO SOLUTION) UNDER GABBERIA SGH , HOWRAH ON 30\/10\/2023","50":"Amendment-Corrigendum Notice- 3127 dated 30\/10\/2023 for Selection of Private Partner for setting up & operationalization of a Radiotherapy Centre at Midnapore MCH under PPP Cell","51":"Extension of timeline for signing of agreement of establishment & maintenance of CT scan centres & Dialysis centres of at different Govt. Hospitals on PPP mode","52":"Cancellation of Quotation Notice reg. procurement of printing materials under AYUSH Gram Activitiy in Alipurduar District with memo no- CMOH\/APD\/3217 dated 22\/09\/2023","53":"Advertisement for Admission into Diploma Course in Ayurvedic Pharmacy for the Session 2023-2024.","54":"Notice on review & visioning workshop on Viral Hepatitis on 9th & 10th Nov, 2023","55":"AOC\/ Letter of Acceptance\/ Work Order for Re-E-Tender (2nd Call) for procurement of ECD kit under DPMU, Nadia vide Memo No.CMOH-Nad\/4167, dt-25.07.2023","56":"Notice for Meeting on Pre Bid Tender for supply of rental Vehicles under DFWB, Kolkata on 31\/10\/2023","57":"Notice regarding Extension of last date of online bid submission with memo no DHFWS\/CW\/30 2022-23(3rd call) and DHFWS\/CW\/13 2023-24(2nd call) for creation of herbal garden under CMOH Jalpaiguri till 3\/11\/2023","58":"Minutes of Meeting of State Level Expert Committee on Radiology and Dialysis on 13\/10\/2023","59":"Corrigendum regarding Minutes of the Pre Bid Meeting for RFP for Selection of Private Partner for Setting up and operationalization of a Radiotherapy Centre at Midnapore Medical College & Hospital under PPP Mode","60":"Intimation regarding Slow Moving\/Short Expiry date of medicine, College Of Medicine & J N Medical Hospital, Kalyani","61":"Nomination as non-official members of the West Bengal Mental Health Authority.","62":"Financial bid Assessment of Notice Inviting Quotation for Equipments\/ Items for Burdwan Medical College & Hospital vide Memo No. BMCH\/2962,2963,2964,2965 dated. 5.10.2023","63":"Quotation Cancellation Notice for supply of Liquified Phenol I.P.99% (Carbolic Acid) at Burdwan Medical College and Hospital, Purba Bardhaman with memo no - BMCH\/2942 dated 4\/10\/2023","64":"Quotation Cancellation Notice for supply of Formalin Solution 40% at Burdwan Medical College and Hospital, Purba Bardhaman with memo no-BMCH\/2941 dated-- 4\/10\/2023","65":"Notice for House Staff (J.R). under MSVP, Malda MC&H","66":"Cancellation notice for the post of JR under Malda MCH with Memo no 6199\/MLDMCH\/1(8) dated 5\/10\/2023","67":"Intimation regarding slow-moving and short expiry medicines of District Hospital, Howrah","68":"Financial Bid Assessment of Burdwan Medical College & Hospital vide Momo no. BMCH\/1817 dated. 16.06.2023","69":"DNB PDCET Notice and Seat Matrix related to State quota counseling 2023.","70":"PPP (Radiology & Dialysis) related Meeting on 13.10.2023 at Swasthya Sathi building, H&FWD, GoWB","71":"Notice relating to cancellation of ASHA engagement notification on contractual basis under CMOH, Purba Bardhawan","72":"Scheduled for PG Ayush Counseling 2023.","73":"Date, Time & Venue of Medical Exam for appointment to the post of Joint Block Development Officer under Panchayats & Rural Development Department","74":"Technical & Financial Bid Assessment of NIQ vide Memo No. BMCH\/2978 Dated 06\/10\/2023 for Burdwan MC&H","75":"Technical & Financial Bid Assessment of NIQ vide Memo No. BMCH\/2977 Dated on 06\/10\/2023 for Burdwan MCH","76":"Notification for documents verification, 1st round counseling and admission to Diploma in Pharmacy Course for Academic Session 2023-24.","77":"Provisional list of kidney patients to attend the Board meeting on 10\/10\/2023","78":"Information Regarding Short expiry Medicine from Midnapore MCH on 6\/10\/2023","79":"Selected bidders meeting for Cleaning and House Keeping Services under CMOH Purba Bardhaman on 11\/10\/2023","80":"Notice on selected bidder from CMOH Uttar Dinajpur with Nit no- 19 of 2023-24 (2nd call)","81":"Date, Time & Venue of Medical Examination for appointment to the post of LDC under Directorate of Forests (5 Candidates).","82":"Intimation regarding short-expiry medicine at Moulani PHC, Mal Block, Jalpaiguri.","83":"Cancellation Notice of E-Tender under Berhampore Mental Hospital, Murshidabad with Tender reference no - BMH\/01\/2023-2024 & Tender id 2023_HFW_552304_1","84":"Intimation regarding short expiry & slow moving medicines at Kharagpur SDH","85":"Information Regarding Near Expiry Medicine from Alipurduar District Hospital","86":"Cancellation of E Tender Notice for CMOH office Cooch Behar with memo no CMOH\/CBR\/2023-2024\/NTEP\/35","87":"Information regarding slow-moving and near expiry medicines of Gandhi Memorial Hospital, Kalyani, Nadia"},"Date":{"0":1701302400000,"1":1701302400000,"2":1701216000000,"3":1701216000000,"4":1701129600000,"5":1701129600000,"6":1701129600000,"7":1701129600000,"8":1701129600000,"9":1701129600000,"10":1701129600000,"11":1701129600000,"12":1700784000000,"13":1700784000000,"14":1700784000000,"15":1700784000000,"16":1700784000000,"17":1700697600000,"18":1700524800000,"19":1700524800000,"20":1700524800000,"21":1700438400000,"22":1700179200000,"23":1700179200000,"24":1700179200000,"25":1700179200000,"26":1699574400000,"27":1699574400000,"28":1699574400000,"29":1699488000000,"30":1699488000000,"31":1699401600000,"32":1699401600000,"33":1699315200000,"34":1699315200000,"35":1699315200000,"36":1699228800000,"37":1699228800000,"38":1699228800000,"39":1699056000000,"40":1698969600000,"41":1698969600000,"42":1698969600000,"43":1698883200000,"44":1698883200000,"45":1698883200000,"46":1698710400000,"47":1698710400000,"48":1698624000000,"49":1698624000000,"50":1698624000000,"51":1698624000000,"52":1698624000000,"53":1698624000000,"54":1697500800000,"55":1697500800000,"56":1697500800000,"57":1697500800000,"58":1697414400000,"59":1697414400000,"60":1697414400000,"61":1697155200000,"62":1697068800000,"63":1696982400000,"64":1696982400000,"65":1696982400000,"66":1696982400000,"67":1696982400000,"68":1696896000000,"69":1696896000000,"70":1696896000000,"71":1696896000000,"72":1696809600000,"73":1696809600000,"74":1696550400000,"75":1696550400000,"76":1696550400000,"77":1696550400000,"78":1696550400000,"79":1696550400000,"80":1696464000000,"81":1696464000000,"82":1696377600000,"83":1696377600000,"84":1696291200000,"85":1696291200000,"86":1696291200000,"87":1696291200000},"Link":{"0":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/List_of_Ineligible_Candidates_for_various_posts_(Memo_No.DHFWS-1122-23_dated-26_.07_.2023)_.pdf","1":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Tender_cancellation_Notice_for_procurement_of_Dental_Equipments_(Non_CAT)_from_Alipurduar_district.pdf","2":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/9668.pdf","3":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/DME_165.pdf","4":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Document_295.pdf","5":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/5221.pdf","6":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/JBR-1785.pdf","7":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/2563.pdf","8":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/9339.pdf","9":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/9338.pdf","10":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/7564.pdf","11":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/short_expiry_(28.11_.2023)_.pdf","12":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/95421.pdf","13":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/ext._(1)_.pdf","14":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/scan1110.pdf","15":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Cleaning_Housekeeping__Offer_letter_March_202420231124_14554082.pdf","16":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/vacancy_list_for_29th_counselling.pdf","17":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Request_for_distribution_of_very_slow_moving_medicines_to_other_units(5177_of_23.11_.2023)_.pdf","18":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/EXPRESSION_OF_INTEREST,_RG_KAR_MC_5757.pdf","19":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/a.pdf","20":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/ilovepdf_merged_(1)3.pdf","21":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/1700553325762.pdf","22":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/scan0362-1.pdf","23":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Notice_for_walk-in-counselling_for_CPCH_qualified_candidates.pdf","24":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Notice_for_walk-in-counselling_for_transfer_of_59_CHOs.pdf","25":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/mes1.pdf","26":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/img20231111_13152007.pdf","27":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/9511.pdf","28":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/13060.pdf","29":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/22082.pdf","30":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/2331.pdf","31":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Information_regarding_Near_Expiry_Medicine,_November-2023.pdf","32":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/WhatsApp_Image_2023-11-08_at_3.20_.37_PM_.pdf","33":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/MB-931.pdf","34":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/34841.pdf","35":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/2885.pdf","36":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/31561.pdf","37":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/3157.pdf","38":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/6183.pdf","39":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/6236.pdf","40":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/28611.pdf","41":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/M-1301.pdf","42":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/10861.pdf","43":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Tech_Fin_BID_3088.pdf","44":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/30871.pdf","45":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/30902.pdf","46":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/2796.pdf","47":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/15891.pdf","48":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/ilovepdf_merged_(1)2.pdf","49":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/8352.pdf","50":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Amendment-Corrigendum_Notice_3127_(1).pdf","51":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Extension_of_timeline_for_signing_agreement_3128.pdf","52":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Cancellation_of_Quotation_Notice_under_AYUSH_Gram_Activitiy_in_Alipurduar_district.pdf","53":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/9313.pdf","54":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/5602.pdf","55":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/AOC7.pdf","56":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Notice_for_Pre_Bid_Meeting_for_Tender_Notice_for_supply_of_rental_vehicles.pdf","57":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Website_Notice._.pdf","58":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/MoM_RADIOLOGY_AND_DIALYSIS_149.pdf","59":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Radiotherapy_documents_merged_16.10_.23_.pdf","60":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/3569.pdf","61":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Nomination_as_non-official_members_of_the_West_Bengal_Mental_Health_Authority.pdf","62":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Financial_Bid_Assessment_not_matured_memo_2965.pdf","63":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/2942_Cancel.pdf","64":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/2941_Cancel.pdf","65":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/6200.pdf","66":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/16991.pdf","67":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/5966.pdf","68":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Rectified_Financial_bid_of_memo_1817.pdf","69":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/DNB_PDCET_Notice_and_Seat_Matrix_related_to_State_quota_counseling_2023_.pdf","70":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/SPSRC-142.pdf","71":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/7441.pdf","72":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/pg_ayush_schedule_2023-rotated.pdf","73":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/9061.pdf","74":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Tech_Fin_2978.pdf","75":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Tech_Fin_2977.pdf","76":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/26331.pdf","77":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/list_of_kidney_parients.pdf","78":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/7372.pdf","79":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/MEMO_NO.2597_DT_.06_10_2023_.pdf","80":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/31241.pdf","81":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/896.pdf","82":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/Mal_01.pdf","83":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/2802.pdf","84":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/22812.pdf","85":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/6627.pdf","86":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/NTEP35.pdf","87":"https:\/\/www.wbhealth.gov.in\/uploaded_files\/notice\/1440.pdf"}}